import React from "react";

export default function RecommendResultPage() {
  return <div>결과 공유 페이지</div>;
}

// 응답 예시
// INPUT
// {
//   "age": "50대",
//   "gender": "여성",
//   "season": "봄",
//   "weather": "맑음",
//   "style": "정장",
//   "mood": "단정한",
//   "additionalInfo": "친한 동생의 딸의 결혼식을 가기로 했어요."
// }

// OUTPUT
// {
//   "success_response": {
//       "status": 200,
//       "data": {
//           "info": {
//               "summary": "패션 추천 결과입니다.",
//               "details": {
//                   "status": 200,
//                   "data": {
//                       "info": {
//                           "summary": "50대 여성의 결혼식 참석을 위한 정장 스타일 추천.",
//                           "details": "맑은 봄 날씨에 어울리는 단정한 정장스타일로, 다음과 같은 착장을 추천합니다. 하늘색 또는 연한 핑크색의 **블레이저**와 같은 경량 자켓 위에 **흰색 블라우스**를 매치해줍니다. 하의로는 체형에 맞는 직거울 실루엣의 **슬랙스**나 기장은 적당하고 허리선을 정리해줄 수 있는 **롱 스커트**도 좋습니다. 포멀함을 더하기 위해 반드시 심플한-h 의 가벼운 페이턴으츠 앵클부츠로 섬세하게 매칭하고, 액세서리 역시 은은한 귀걸이나 매칭되는 목걸이 등으로 포인트를 주는 것이 좋습니다.",
//                           "keywords": [
//                               "50대 여성",
//                               "봄 결혼식",
//                               "정장 스타일",
//                               "단정한 룩",
//                               "폴리소재 빈티지 블레이저"
//                           ],
//                           "related": [
//                               "블레이저",
//                               "타이트 스커트",
//                               "고급스러운 지갑",
//                               "컬러 매치"
//                           ]
//                       }
//                   }
//               },
//               "keywords": [],
//               "related": []
//           }
//       }
//   }
// }
// **베이직한 블랙 터틀넥 스웨터** 는 KEYWORD 추출, BOLD로 활용 가능
